wiki/maven/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>关于Maven的一些笔记</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="关于Maven的一些笔记"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-12 Fri"/>
<meta name="author" content="Kelvin Hu"/>
<meta name="description" content="records some notes during learning/practicing maven"/>
<meta name="keywords" content="java, maven"/>
<link href="/media/css/main.css" rel="stylesheet" type="text/css" />


</head>
<body>

<div id="preamble">
<hgroup id="header">
  <h1><a href="/">Kelvin的胡言乱语</a></h1>
  <h2>重剑无锋，大巧不工。</h2>
</hgroup>
<nav id="main-nav">
  <ul id="nav-list-main">
    <li><a href="/blog/" class="menu">Blog</a></li>
    <li><a href="/wiki/" class="menu">Wiki</a></li>
    <li><a href="/tags/" class="menu">Tags</a></li>
    <li><a href="/about/" class="menu">About</a></li>
  </ul>
</nav>
<nav id="sub-nav" class="align-right">
  <div class="social">
    <a class="github" title="GitHub" href="https://github.com/kelvinh">GitHub</a>
    <!-- TODO: change the link below to proper value  -->
    <a class="rss" title="RSS(TODO)" href="TODO">RSS</a>
  </div>
  <form class="search" target="_blank" method="get" action="http://google.com/search">
    <input type="hidden" value="site:kelvinh.github.com" name="q" />
    <input type="text" class="align-right" results="0" name="q" />
  </form>
</nav>

</div>

<div id="content">
<h1 class="title">关于Maven的一些笔记</h1>

<p>Maven是一个用于java project management的工具，和Ant不同，Ant相当于make，你写一个task，它就执行一个task，你让它copy，它就copy；而Maven则是专注于更加high level的整个project的generation/management/compile/distribution等一系列操作。
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">pom.xml文件中的一些node的作用：</h2>
<div class="outline-text-2" id="text-1">


<p>
  POM全称Project Object Model，在pom.xml中，以下结点是常用的，意义如下（摘自Maven Manual）：
</p>
<ul>
<li><code>project</code> This is the top-level element in all Maven pom.xml files.

</li>
<li><code>modelVersion</code> This element indicates what version of the object model this POM is using. The version of the model itself changes very infrequently but it is mandatory in order to ensure stability of use if and when the Maven developers deem it necessary to change the model.

</li>
<li><code>groupId</code> This element indicates the unique identifier of the organization or group that created the project. The groupId is one of the key identifiers of a project and is typically based on the fully qualified domain name of your organization. For example org.apache.maven.plugins is the designated groupId for all Maven plug-ins.

</li>
<li><code>artifactId</code> This element indicates the unique base name of the primary artifact being generated by this project. The primary artifact for a project is typically a JAR file. Secondary artifacts like source bundles also use the artifactId as part of their final name. A typical artifact produced by Maven would have the form &lt;artifactId&gt;-&lt;version&gt;.&lt;extension&gt; (for example, myapp-1.0.jar).

</li>
<li><code>packaging</code> This element indicates the package type to be used by this artifact (e.g. JAR, WAR, EAR, etc.). This not only means if the artifact produced is JAR, WAR, or EAR but can also indicate a specific lifecycle to use as part of the build process. (The lifecycle is a topic we will deal with further on in the guide. For now, just keep in mind that the indicated packaging of a project can play a part in customizing the build lifecycle.)  The default value for the packaging element is JAR so you do not have to specify this for most projects.

</li>
<li><code>version</code> This element indicates the version of the artifact generated by the project. Maven goes a long way to help you with version management and you will often see the SNAPSHOT designator in a version, which indicates that a project is in a state of development. We will discuss the use of snapshots and how they work further on in this guide.

</li>
<li><code>name</code> This element indicates the display name used for the project. This is often used in Maven's generated documentation.

</li>
<li><code>url</code> This element indicates where the project's site can be found. This is often used in Maven's generated documentation.

</li>
<li><code>description</code> This element provides a basic description of your project. This is often used in Maven's generated documentation.
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Create a web project:</h2>
<div class="outline-text-2" id="text-2">


<pre class="example">
mvn archetype:generate -DarchetypeArtifactId=maven-archetype-webapp
</pre>


<p>
  This will create a web project, and goes into interactive mode, to read groupId etc. from the standard input.
</p></div>
</div>
</div>

<div id="postamble">
<div id="post-meta">
  <span title="post date" class="post-info">2012-10-12</span>
  <span title="last modification date" class="update-info">2013-04-01</span>
  <span title="tags" class="tags"><a href="/tags/java/">Java</a>, <a href="/tags/maven/">Maven</a></span>
  <span title="author" class="author">Kelvin Hu</span>
</div>
<div id="footer">
  <p class="creator">Generated by Org version 7.9.4 with Emacs version 24</p>
  <p class="copyright">
    Copyright &copy; 2012 - 2013 <a href="mailto:ini &lt;dot&gt; kelvin &lt;at&gt; gmail &lt;dot&gt; com">Kelvin Hu</a>
    &nbsp;&nbsp;-&nbsp;&nbsp;
    Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
  </p>
</div>

</div>
</body>
</html>
